# 4.9 Intro to Data Visualization in Python Part 1

## This script includes the following points:

####  Q3.  Import libraries and new customer data set as dataframe
####  Q4.  Data Wrangling:  rename columns with logical names and drop unneeded columns
####  Q5.  Data Quality and consistency checks:  address missing values and duplicates and convert any mixed-type data
####  Q6.  Combine customer data with the rest of prepared Instacart data
####  Q7.  Export new dataframe to pickle file to be used for Part 2 of task

#  Q3.  Import libraries and new customer data set as dataframe

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create path
path = r'/Users/andrewruhnow/Documents/12-2023 Instacart Basket Analysis'

In [3]:
path

'/Users/andrewruhnow/Documents/12-2023 Instacart Basket Analysis'

In [4]:
# Import new customer data zip file
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Q4.  Data wrangling: rename columns with logical names and drop unneeded columns

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_customers.shape

(206209, 10)

In [7]:
# Rename columns
df_customers.rename(columns = {'Surnam' : 'Last Name' , 'fam_status' : 'family_status' , 'STATE' : 'State' , 'n_dependants' : 'dependants'}, inplace = True)

In [8]:
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

All columns contain important information and are needed for analysis.

# Q5.  Data Quality and consistency checks:  address missing values and duplicates and convert any mixed-type data

In [9]:
# Checking for duplicates
df_duplicates = df_customers[df_customers.duplicated()]

In [10]:
df_duplicates

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, dependants, family_status, income]
Index: []

No duplicates found

In [11]:
# Check for mixed-type data
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   First Name     194950 non-null  object
 2   Last Name      206209 non-null  object
 3   Gender         206209 non-null  object
 4   State          206209 non-null  object
 5   Age            206209 non-null  int64
 6   date_joined    206209 non-null  object
 7   dependants     206209 non-null  int64
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

No mixed-type data.  However, datetime data type for date_joined would be more appropriate

In [12]:
# Change date_joined data type to datetime data type
df_customers['date_joined'] = pd.to_datetime(df_customers['date_joined'])

In [13]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   First Name     194950 non-null  object
 2   Last Name      206209 non-null  object
 3   Gender         206209 non-null  object
 4   State          206209 non-null  object
 5   Age            206209 non-null  int64
 6   date_joined    206209 non-null  datetime64[ns]
 7   dependants     206209 non-null  int64
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 15.7+ MB

In [14]:
# Check for missing values
df_customers.isnull().sum()

user_id              0
First Name       11259
Last Name            0
Gender               0
State                0
Age                  0
date_joined          0
dependants           0
family_status        0
income               0
dtype: int64

Output for First Name shows 11,259 missing values

In [15]:
# View missing values and create subset containing only missing values
df_nan_values = df_customers[df_customers['First Name'].isnull()==True]

In [16]:
df_nan_values

,user_id,First Name,Last Name,Gender,State,Age,date_joined,dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,2017-01-01,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,2017-01-01,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,2017-01-01,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,2017-01-01,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,2017-01-01,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,2020-03-31,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,2020-04-01,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,2020-04-01,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,2020-04-01,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,2020-04-01,2,married,59222

Given that the missing values are only in the "First Name" column I think its better to keep them.  Doing so will ensure a larger data set and analysis will be more reliable.  We can improve clarity by replacing NaN values with "Unknown".

In [17]:
# Replace NaN with Unknown
df_customers['First Name'].fillna('Unknown', inplace = True)

In [18]:
df_customers.isnull().sum()

user_id          0
First Name       0
Last Name        0
Gender           0
State            0
Age              0
date_joined      0
dependants       0
family_status    0
income           0
dtype: int64

In [19]:
df_customers['First Name'].value_counts()

First Name
Unknown    11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

# Q6.  Combine customer data with the rest of prepared Instacart data

In [20]:
# Import orders_products_merged_agg_grouped.pkl file
df_merge_all = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_agg_grouped.pkl'))

In [21]:
# Check shape of df_merge_all vs df_customers
df_merge_all.shape

(32434212, 25)

In [22]:
df_customers.shape

(206209, 10)

In [23]:
# Check data types to determine best way to combine both dataframes
df_merge_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 25 columns):
 #   Column                     Dtype
---  ------                     -----
 0   product_id                 int64
 1   product_name               object
 2   aisle_id                   int64
 3   department_id              int64
 4   prices                     float64
 5   order_id                   int64
 6   user_id                    int64
 7   order_number               int64
 8   orders_day_of_week         int64
 9   order_hour_of_day          int64
 10  days_since_prior_order     float64
 11  first_order                bool
 12  add_to_cart_order          int64
 13  reordered                  int64
 14  _merge                     category
 15  price_range_loc            object
 16  busiest_day                object
 17  busiest_days               object
 18  busiest_period_of_day      object
 19  max_order                  int64
 20  loyalty_flag               object
 21  average spent              float64
 22  spender_flag               object
 23  Customer_orders_frequency  float64
 24  frequency_flag             object
dtypes: bool(1), category(1), float64(4), int64(11), object(8)
memory usage: 5.6+ GB

In [24]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   First Name     206209 non-null  object
 2   Last Name      206209 non-null  object
 3   Gender         206209 non-null  object
 4   State          206209 non-null  object
 5   Age            206209 non-null  int64
 6   date_joined    206209 non-null  datetime64[ns]
 7   dependants     206209 non-null  int64
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 15.7+ MB

In [25]:
# Drop _merge column since it's not needed
df_merge_all = df_merge_all.drop(columns = ['_merge'])

Going to merge the dataframes using the user_id columns and both have same data type int64

In [26]:
# Merge user_id columns since both columns are in both data frames
df_ords_prods_customers_merged = df_merge_all.merge(df_customers, on = 'user_id', indicator = True)

In [27]:
# Confirm results using merge flag
df_ords_prods_customers_merged.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,First Name,Last Name,Gender,State,Age,date_joined,dependants,family_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,2019-08-01,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,2019-08-01,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Charles,Cox,Male,Minnesota,81,2019-08-01,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Charles,Cox,Male,Minnesota,81,2019-08-01,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Charles,Cox,Male,Minnesota,81,2019-08-01,1,married,49620,both

In [28]:
# Checking values in _merge column using merge flag
df_ords_prods_customers_merged['_merge'].value_counts()

_merge
both          32434212
left_only            0
right_only           0
Name: count, dtype: int64

In [29]:
df_ords_prods_customers_merged.shape

(32434212, 34)

# Q7.  Export new dataframe to pickle file to be used for Part 2 of task

In [30]:
df_ords_prods_customers_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_merged.pkl'))